siade/app/templates/infogreffe_kbis_entreprise_request.xml.erb

<soapenv:Envelope xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns:urn='urn:WebServicesProduits'>
  <soapenv:Header/>
  <soapenv:Body>
    <urn:getProduitsWebServicesXML soapenv:encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'>
      <arg0 xsi:type='xsd:string'>
        <demande>
          <emetteur>
            <code_abonne><%= infogreffe_code_abonne %></code_abonne>
            <mot_passe><%= infogreffe_mot_passe %></mot_passe>

            <code_requete>
              <type_profil>A</type_profil>
              <origine_emetteur>IC</origine_emetteur>
              <nature_requete>C</nature_requete>
              <type_document><%= document_type %></type_document>
              <type_requete>S</type_requete>
              <media>WS</media>
              <mode_diffusion>
                <mode type="XL"/>
              </mode_diffusion>
            </code_requete>
          </emetteur>

          <commande>
            <num_siren><%= siren %></num_siren>
          </commande>
        </demande>
      </arg0>
    </urn:getProduitsWebServicesXML>
  </soapenv:Body>
</soapenv:Envelope>
